**Merge left i right**

In [1]:
import pandas as pd
import numpy as np

In [2]:
products=pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/northwind/products.csv',
                      usecols=['ProductID', 'ProductName'])
ordered =pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/northwind/order-details_del.csv',
                      usecols=['OrderID', 'ProductID', 'UnitPrice', 'Quantity'])
products.head()

   ProductID                   ProductName
0          1                          Chai
1          2                         Chang
2          3                 Aniseed Syrup
3          4  Chef Anton's Cajun Seasoning
4          5        Chef Anton's Gumbo Mix

In [4]:
ordered.head()

   OrderID  ProductID  UnitPrice  Quantity
0    10331         54        5.9        15
1    10332         18       50.0        40
2    10332         42       11.2        10
3    10332         47        7.6        16
4    10333         14       18.6        10

Połączenie metodą merge z argumentem how='left'

In [5]:
merged = products.merge(right=ordered, on='ProductID', how='left', indicator=True)
merged.head()

   ProductID ProductName  OrderID  UnitPrice  Quantity _merge
0          1        Chai  10348.0       14.4      15.0   both
1          1        Chai  10354.0       14.4      12.0   both
2          1        Chai  10370.0       14.4      15.0   both
3          1        Chai  10406.0       14.4      10.0   both
4          1        Chai  10413.0       14.4      24.0   both

In [6]:
merged['_merge'].value_counts()

both          289
left_only       5
right_only      0
Name: _merge, dtype: int64

Połączenie metodą merge z argumentem how='right'

In [7]:
merged = products.merge(right=ordered, on='ProductID', how='right', indicator=True)
merged.head()

,ProductID,ProductName,OrderID,UnitPrice,Quantity,_merge
0,54,Tourtière,10331,5.9,15,both
1,18,Carnarvon Tigers,10332,50.0,40,both
2,42,Singaporean Hokkien Fried Mee,10332,11.2,10,both
3,47,Zaanse koeken,10332,7.6,16,both
4,14,Tofu,10333,18.6,10,both

In [8]:
merged['_merge'].value_counts()

both          289
left_only       0
right_only      0
Name: _merge, dtype: int64

Zamiana tabel miejscami - wynik będzie taki sam

In [10]:
merged = ordered.merge(right=products, on='ProductID', how='right', indicator=True)
merged.head()

   OrderID  ProductID  UnitPrice  Quantity ProductName _merge
0  10348.0          1       14.4      15.0        Chai   both
1  10354.0          1       14.4      12.0        Chai   both
2  10370.0          1       14.4      15.0        Chai   both
3  10406.0          1       14.4      10.0        Chai   both
4  10413.0          1       14.4      24.0        Chai   both

In [11]:
merged['_merge'].value_counts()

both          289
right_only      5
left_only       0
Name: _merge, dtype: int64

In [13]:
filter = merged['_merge'] == 'right_only'
merged[filter]

,OrderID,ProductID,UnitPrice,Quantity,ProductName,_merge
16,NaN,6,NaN,NaN,Grandma's Boysenberry Spread,right_only
38,NaN,15,NaN,NaN,Genen Shouyu,right_only
85,NaN,27,NaN,NaN,Schoggi Schokolade,right_only
242,NaN,66,NaN,NaN,Louisiana Hot Spiced Okra,right_only
243,NaN,67,NaN,NaN,Laughing Lumberjack Lager,right_only